In [18]:
import pandas as pd

In [19]:
data = pd.read_csv("https://raw.githubusercontent.com/ID2223KTH/id2223kth.github.io/master/assignments/lab1/titanic.csv")

In [20]:
data.to_csv('titanic.csv',index = False)

In [21]:
data = pd.read_csv('titanic.csv')

In [22]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
data_processed = data.copy()

In [8]:
# Fill missing data with either random data or a category corresponding to "Unknown"
# Transform categorical variables into numerical variables
# Drop columns that do not have predictive power
# Write the features to the feature store as a Feature Group
# Read the features split the data into training and testing sets

In [24]:
data_processed = data_processed.drop(columns = ['PassengerId','Name','Ticket','Cabin'])

In [25]:
data_processed.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [28]:
data_processed.Sex[data_processed.Sex == 'male'] = 0
data_processed.Sex[data_processed.Sex == 'female'] = 1

In [35]:
data_processed.Embarked[data_processed.Embarked == 'S'] = 0
data_processed.Embarked[data_processed.Embarked == 'C'] = 1
data_processed.Embarked[data_processed.Embarked == 'Q'] = 2

In [36]:
data_processed

     Survived  Pclass Sex   Age  SibSp  Parch     Fare Embarked
0           0       3   0  22.0      1      0   7.2500        0
1           1       1   1  38.0      1      0  71.2833        1
2           1       3   0  26.0      0      0   7.9250        0
3           1       1   0  35.0      1      0  53.1000        0
4           0       3   0  35.0      0      0   8.0500        0
..        ...     ...  ..   ...    ...    ...      ...      ...
886         0       2   0  27.0      0      0  13.0000        0
887         1       1   0  19.0      0      0  30.0000        0
888         0       3   0   NaN      1      2  23.4500        0
889         1       1   1  26.0      0      0  30.0000        1
890         0       3   2  32.0      0      0   7.7500        2

[891 rows x 8 columns]

In [37]:
data_processed = data_processed.dropna().astype(float)

In [38]:
data_processed

     Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0.0     3.0  0.0  22.0    1.0    0.0   7.2500       0.0
1         1.0     1.0  1.0  38.0    1.0    0.0  71.2833       1.0
2         1.0     3.0  0.0  26.0    0.0    0.0   7.9250       0.0
3         1.0     1.0  0.0  35.0    1.0    0.0  53.1000       0.0
4         0.0     3.0  0.0  35.0    0.0    0.0   8.0500       0.0
..        ...     ...  ...   ...    ...    ...      ...       ...
885       0.0     3.0  2.0  39.0    0.0    5.0  29.1250       2.0
886       0.0     2.0  0.0  27.0    0.0    0.0  13.0000       0.0
887       1.0     1.0  0.0  19.0    0.0    0.0  30.0000       0.0
889       1.0     1.0  1.0  26.0    0.0    0.0  30.0000       1.0
890       0.0     3.0  2.0  32.0    0.0    0.0   7.7500       2.0

[712 rows x 8 columns]

In [40]:
data_processed.to_csv('titanic_processed.csv',index = False)